/*******************************************************************
					输出整数的每位数

*******************************************************************/
#include<stdio.h>
int main()
{
	int q,b,s,g,x,a,c;
	printf("请输入0-9999之间的任意一个整数\n");
	scanf("%d",&x);
	if(0<=x&&x<=9999)
	{	q=x/1000;g=x%10;a=x/100;b=a-10*q;c=x%100;s=c/10;
		if(q>0) 
			printf("千位数为%d，百位数为%d，十位数为%d，个位数为%d\n",q,b,s,g);
		else if(b>0) printf("百位数为%d，十位数为%d，个位数为%d\n",b,s,g);
			 else if(s>0) printf("十位数为%d，个位数为%d\n",s,g);
					else printf("个位数为%d\n",g);
	}
	else printf("输入错误\n");
}
