/***********************************************************

						计算器

**********************************************************/
#include<stdio.h>
int main()
{
	float a,b,d;int c;
	printf("**************************************\n");
	printf("                计算器                \n");
	printf("**************************************\n");
	printf("加法运算——1  减法运算——2\n乘法运算——3  除法运算——4\n");
	printf("请选择运算\n");
	scanf("%d",&c);
	if(c==1)
	 {
		printf("请输入加数，被加数\n");
		scanf("%f%f",&a,&b);
		d=a+b;
		printf("和为%g\n",d);
	 }
	if(c==2)
	 {
		printf("请输入减数，被减数\n");
		scanf("%f%f",&a,&b);
		d=a-b;
		printf("差为%g\n",d);
	 }
	if(c==3)
	 {
		printf("请输入乘数，被乘数\n");
		scanf("%f%f",&a,&b);
		d=a*b;
		printf("积为%g\n",d);
	 }	
	if(c==4)
	 {
		printf("请输入除数，被除数\n");
		scanf("%f%f",&a,&b);
		d=a/b;
		printf("商为%g\n",d);
	 }	
}
